RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gptimer.h
/******************************************************************************
*  Filename:       hw_gptimer.h
*  Revised:        $Date: 2013-04-12 15:10:54 +0200 (Fri, 12 Apr 2013) $
*  Revision:       $Revision: 9735 $
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_GPTIMER_H__
#define __HW_GPTIMER_H__

//*****************************************************************************
//
// The following are defines for the GPTIMER register offsets.
//
//*****************************************************************************
#define GPTIMER_O_CFG           0x00000000  // GPTM configuration This 
                                            // register configures the global 
                                            // operation of the GPTM. The value 
                                            // written to this register 
                                            // determines whether the GPTM is 
                                            // in 32-bit mode (concatenated 
                                            // timers) or in 16-bit mode 
                                            // (individual, split timers). 
#define GPTIMER_O_TAMR          0x00000004  // GPTM Timer A mode This register 
                                            // configures the GPTM based on the 
                                            // configuration selected in the 
                                            // CFG register. This register 
                                            // controls the modes for Timer A 
                                            // when it is used individually. 
                                            // When Timer A and Timer B are 
                                            // concatenated, this register 
                                            // controls the modes for both 
                                            // Timer A and Timer B, and the 
                                            // contents of TBMR are ignored. 
#define GPTIMER_O_TBMR          0x00000008  // GPTM Timer B mode This register 
                                            // configures the GPTM based on the 
                                            // configuration selected in the 
                                            // CFG register. This register 
                                            // controls the modes for Timer B 
                                            // when it is used individually. 
                                            // When Timer A and Timer B are 
                                            // concatenated, this register is 
                                            // ignored and TBMR controls the 
                                            // modes for both Timer A and Timer 
                                            // B. 
#define GPTIMER_O_CTL           0x0000000C  // GPTM control This register is 
                                            // used alongside the CFG and TnMR 
                                            // registers to fine-tune the timer 
                                            // configuration, and to enable 
                                            // other features such as timer 
                                            // stall. 
#define GPTIMER_O_SYNC          0x00000010  // GPTM synchronize Note: This 
                                            // register is implemented on GPTM 
                                            // 0 base address only. This 
                                            // register does however, allow 
                                            // software to synchronize a number 
                                            // of timers. 
#define GPTIMER_O_IMR           0x00000018  // GPTM interrupt mask This 
                                            // register allows software to 
                                            // enable and disable GPTM 
                                            // controller-level interrupts. 
                                            // Setting a bit enables the 
                                            // corresponding interrupt, while 
                                            // clearing a bit disables it. 
#define GPTIMER_O_RIS           0x0000001C  // GPTM raw interrupt status This 
                                            // register shows the state of the 
                                            // GPTM internal interrupt signal. 
                                            // These bits are set whether or 
                                            // not the interrupt is masked in 
                                            // the IMR register. Each bit can 
                                            // be cleared by writing 1 to its 
                                            // corresponding bit in ICR. 
#define GPTIMER_O_MIS           0x00000020  // GPTM masked interrupt status 
                                            // This register shows the state of 
                                            // the GPTM controller-level 
                                            // interrupt. If an interrupt is 
                                            // unmasked in IMR, and there is an 
                                            // event that causes the interrupt 
                                            // to be asserted, the 
                                            // corresponding bit is set in this 
                                            // register. All bits are cleared 
                                            // by writing 1 to the 
                                            // corresponding bit in ICR. 
#define GPTIMER_O_ICR           0x00000024  // GPTM interrupt clear This 
                                            // register is used to clear the 
                                            // status bits in the RIS and MIS 
                                            // registers. Writing 1 to a bit 
                                            // clears the corresponding bit in 
                                            // the RIS and MIS registers. 
#define GPTIMER_O_TAILR         0x00000028  // GPTM Timer A interval load When 
                                            // the Timer is counting down, this 
                                            // register is used to load the 
                                            // starting count value into the 
                                            // Timer. When the Timer is 
                                            // counting up, this register sets 
                                            // the upper bound for the timeout 
                                            // event. When a GPTM is configured 
                                            // to one of the 32-bit modes, 
                                            // TAILR appears as a 32-bit 
                                            // register (the upper 16-bits 
                                            // correspond to the contents of 
                                            // the GPTM Timer B Interval Load 
                                            // (TBILR) register). In a 16-bit 
                                            // mode, the upper 16 bits of this 
                                            // register read as 0s and have no 
                                            // effect on the state of TBILR. 
#define GPTIMER_O_TBILR         0x0000002C  // GPTM Timer B interval load When 
                                            // the Timer is counting down, this 
                                            // register is used to load the 
                                            // starting count value into the 
                                            // Timer. When the Timer is 
                                            // counting up, this register sets 
                                            // the upper bound for the time-out 
                                            // event. When a GPTM is configured 
                                            // to one of the 32-bit modes, the 
                                            // contents of bits [15:0] in this 
                                            // register are loaded into the 
                                            // upper 16 bits of the TAILR 
                                            // register. Reads from this 
                                            // register return the current 
                                            // value of Timer B and writes are 
                                            // ignored. In a 16-bit mode, bits 
                                            // [15:0] are used for the load 
                                            // value. Bits [31:16] are reserved 
                                            // in both cases. 
#define GPTIMER_O_TAMATCHR      0x00000030  // GPTM Timer A match This 
                                            // register is loaded with a match 
                                            // value. Interrupts can be 
                                            // generated when the Timer value 
                                            // is equal to the value in this 
                                            // register in one-shot or periodic 
                                            // mode. When a GPTM is configured 
                                            // to one of the 32-bit modes, 
                                            // TAMATCHR appears as a 32-bit 
                                            // register (the upper 16-bits 
                                            // correspond to the contents of 
                                            // the GPTM Timer B match 
                                            // (GPTMTBMATCHR) register). In a 
                                            // 16-bit mode, the upper 16 bits 
                                            // of this register read as 0s and 
                                            // have no effect on the state of 
                                            // TBMATCHR. 
#define GPTIMER_O_TBMATCHR      0x00000034  // PTM Timer B match This register 
                                            // is loaded with a match value. 
                                            // Interrupts can be generated when 
                                            // the Timer value is equal to the 
                                            // value in this register in 
                                            // one-shot or periodic mode. When 
                                            // a GPTM is configured to one of 
                                            // the 32-bit modes, the contents 
                                            // of bits [15:0] in this register 
                                            // are loaded into the upper 16 
                                            // bits of the TAMATCHR register. 
                                            // Reads from this register return 
                                            // the current match value of Timer 
                                            // B and writes are ignored. In a 
                                            // 16-bit mode, bits [15:0] are 
                                            // used for the match value. Bits 
                                            // [31:16] are reserved in both 
                                            // cases. 
#define GPTIMER_O_TAPR          0x00000038  // GPTM Timer A prescale This 
                                            // register allows software to 
                                            // extend the range of the 16-bit 
                                            // Timers in periodic and one-shot 
                                            // modes. 
#define GPTIMER_O_TBPR          0x0000003C  // GPTM Timer B prescale This 
                                            // register allows software to 
                                            // extend the range of the 16-bit 
                                            // Timers in periodic and one-shot 
                                            // modes. 
#define GPTIMER_O_TAPMR         0x00000040  // GPTM Timer A prescale match 
                                            // This register effectively 
                                            // extends the range of TAMATCHR to 
                                            // 24 bits when operating in 
                                            // 16-bit, one-shot or periodic 
                                            // mode. 
#define GPTIMER_O_TBPMR         0x00000044  // GPTM Timer B prescale match 
                                            // This register effectively 
                                            // extends the range ofMTBMATCHR to 
                                            // 24 bits when operating in 
                                            // 16-bit, one-shot or periodic 
                                            // mode. 
#define GPTIMER_O_TAR           0x00000048  // GPTM Timer A This register 
                                            // shows the current value of the 
                                            // Timer A counter. When a GPTM is 
                                            // configured to one of the 32-bit 
                                            // modes, TAR appears as a 32-bit 
                                            // register (the upper 16-bits 
                                            // correspond to the contents of 
                                            // the GPTM Timer B (TBR) 
                                            // register). In the16-bit Input 
                                            // edge count, input edge time, and 
                                            // PWM modes, bits [15:0] contain 
                                            // the value of the counter and 
                                            // bits 23:16 contain the value of 
                                            // the prescaler, which is the 
                                            // upper 8 bits of the count. Bits 
                                            // [31:24] always read as 0. To 
                                            // read the value of the prescaler 
                                            // in 16-bit, one-shot and periodic 
                                            // modes, read bits [23:16] in the 
                                            // TAV register. 
#define GPTIMER_O_TBR           0x0000004C  // GPTM Timer B This register 
                                            // shows the current value of the 
                                            // Timer B counter. When a GPTM is 
                                            // configured to one of the 32-bit 
                                            // modes, the contents of bits 
                                            // [15:0] in this register are 
                                            // loaded into the upper 16 bits of 
                                            // the TAR register. Reads from 
                                            // this register return the current 
                                            // value of Timer B. In a 16-bit 
                                            // mode, bits 15:0 contain the 
                                            // value of the counter and bits 
                                            // [23:16] contain the value of the 
                                            // prescaler in Input edge count, 
                                            // input edge time, and PWM modes, 
                                            // which is the upper 8 bits of the 
                                            // count. Bits [31:24] always read 
                                            // as 0. To read the value of the 
                                            // prescaler in 16-bit, one-shot 
                                            // and periodic modes, read bits 
                                            // [23:16] in the TBV register. 
#define GPTIMER_O_TAV           0x00000050  // GPTM Timer A value When read, 
                                            // this register shows the current, 
                                            // free-running value of Timer A in 
                                            // all modes. Software can use this 
                                            // value to determine the time 
                                            // elapsed between an interrupt and 
                                            // the ISR entry when using the 
                                            // snapshot feature with the 
                                            // periodic operating mode. When 
                                            // written, the value written into 
                                            // this register is loaded into the 
                                            // TAR register on the next clock 
                                            // cycle. When a GPTM is configured 
                                            // to one of the 32-bit modes, TAV 
                                            // appears as a 32-bit register 
                                            // (the upper 16-bits correspond to 
                                            // the contents of the GPTM Timer B 
                                            // Value (TBV) register). In a 
                                            // 16-bit mode, bits [15:0] contain 
                                            // the value of the counter and 
                                            // bits [23:16] contain the 
                                            // current, free-running value of 
                                            // the prescaler, which is the 
                                            // upper 8 bits of the count in 
                                            // input edge count, input edge 
                                            // time, PWM and one-shot or 
                                            // periodic up count modes. In 
                                            // one-shot or periodic down count 
                                            // modes, the prescaler stored in 
                                            // [23:16] is a true prescaler, 
                                            // meaning bits [23:16] count down 
                                            // before decrementing the value in 
                                            // bits [15:0]. The prescaler its 
                                            // [31:24] always read as 0. 
#define GPTIMER_O_TBV           0x00000054  // GPTM Timer B value When read, 
                                            // this register shows the current, 
                                            // free-running value of Timer B in 
                                            // all modes. Software can use this 
                                            // value to determine the time 
                                            // elapsed between an interrupt and 
                                            // the ISR entry. When written, the 
                                            // value written into this register 
                                            // is loaded into the TBR register 
                                            // on the next clock cycle. When a 
                                            // GPTM is configured to one of the 
                                            // 32-bit modes, the contents of 
                                            // bits 15:0 in this register are 
                                            // loaded into the upper 16 bits of 
                                            // the TAV register. Reads from 
                                            // this register return the current 
                                            // free-running value of Timer B. 
                                            // In a 16-bit mode, bits [15:0] 
                                            // contain the value of the counter 
                                            // and bits [23:16] contain the 
                                            // current, free-running value of 
                                            // the prescaler, which is the 
                                            // upper 8 bits of the count in 
                                            // input edge count, input edge 
                                            // time, PWM and one-shot or 
                                            // periodic up count modes. In 
                                            // one-shot or periodic down count 
                                            // modes, the prescaler stored in 
                                            // [23:16] is a true prescaler, 
                                            // meaning bits [23:16] count down 
                                            // before decrementing the value in 
                                            // bits [15:0]. The prescaler its 
                                            // [31:24] always read as 0. 
#define GPTIMER_O_TAPS          0x0000005C  // GPTM Timer A prescale snapshot 
                                            // For the 32-bit wide GPTM, this 
                                            // register shows the current value 
