RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gptimer.h
                                            // of the Timer A prescaler in the 
                                            // 32-bit modes. This register is 
                                            // ununsed in 16-bit GPTM mode. 
#define GPTIMER_O_TBPS          0x00000060  // GPTM Timer B prescale snapshot 
                                            // For the 32-bit wide GPTM, this 
                                            // register shows the current value 
                                            // of the Timer B prescaler in the 
                                            // 32-bit modes. This register is 
                                            // ununsed in 16-bit GPTM mode. 
#define GPTIMER_O_TAPV          0x00000064  // GPTM Timer A prescale value For 
                                            // the 32-bit wide GPTM, this 
                                            // register shows the current 
                                            // free-running value of the Timer 
                                            // A prescaler in the 32-bit modes. 
                                            // Software can use this value in 
                                            // conjunction with the TAV 
                                            // register to determine the time 
                                            // elapsed between an interrupt and 
                                            // the ISR entry. This register is 
                                            // ununsed in 16- or 32-bit GPTM 
                                            // mode. 
#define GPTIMER_O_TBPV          0x00000068  // GPTM Timer B prescale value For 
                                            // the 32-bit wide GPTM, this 
                                            // register shows the current 
                                            // free-running value of the Timer 
                                            // B prescaler in the 32-bit modes. 
                                            // Software can use this value in 
                                            // conjunction with the TBV 
                                            // register to determine the time 
                                            // elapsed between an interrupt and 
                                            // the ISR entry. This register is 
                                            // ununsed in 16- or 32-bit GPTM 
                                            // mode. 
#define GPTIMER_O_PP            0x00000FC0  // GPTM peripheral properties The 
                                            // PP register provides information 
                                            // regarding the properties of the 
                                            // general-purpose Timer module. 


//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_CFG register.
//
//*****************************************************************************
#define GPTIMER_CFG_GPTMCFG_M   0x00000007  // GPTM configuration The GPTMCFG 
                                            // values are defined as follows: 
                                            // 0x0: 32-bit timer configuration. 
                                            // 0x1: 32-bit real-time clock 0x2: 
                                            // Reserved 0x3: Reserved 0x4: 
                                            // 16-bit timer configuration. The 
                                            // function is controlled by bits 
                                            // [1:0] of GPTMTAMR and GPTMTBMR. 
                                            // 0x5-0x7: Reserved 
#define GPTIMER_CFG_GPTMCFG_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TAMR register.
//
//*****************************************************************************
#define GPTIMER_TAMR_TAPLO      0x00000800  // Legacy PWM operation 0: Legacy 
                                            // operation 1: CCP is set to 1 on 
                                            // time-out. 
#define GPTIMER_TAMR_TAPLO_M    0x00000800
#define GPTIMER_TAMR_TAPLO_S    11
#define GPTIMER_TAMR_TAMRSU     0x00000400  // Timer A match register update 
                                            // mode 0: Update GPTMAMATCHR and 
                                            // GPTMAPR if used on the next 
                                            // cycle. 1: Update GPTMAMATCHR and 
                                            // GPTMAPR if used on the next 
                                            // time-out. If the timer is 
                                            // disabled (TAEN is clear) when 
                                            // this bit is set, GPTMTAMATCHR 
                                            // and GPTMTAPR are updated when 
                                            // the timer is enabled. If the 
                                            // timer is stalled (TASTALL is 
                                            // set), GPTMTAMATCHR and GPTMTAPR 
                                            // are updated according to the 
                                            // configuration of this bit. 
#define GPTIMER_TAMR_TAMRSU_M   0x00000400
#define GPTIMER_TAMR_TAMRSU_S   10
#define GPTIMER_TAMR_TAPWMIE    0x00000200  // GPTM Timer A PWM interrupt 
                                            // enable This bit enables 
                                            // interrupts in PWM mode on 
                                            // rising, falling, or both edges 
                                            // of the CCP output. 0: Interrupt 
                                            // is disabled. 1: Interrupt is 
                                            // enabled. This bit is valid only 
                                            // in PWM mode. 
#define GPTIMER_TAMR_TAPWMIE_M  0x00000200
#define GPTIMER_TAMR_TAPWMIE_S  9
#define GPTIMER_TAMR_TAILD      0x00000100  // GPTM Timer A PWM interval load 
                                            // write 0: Update the GPTMTAR 
                                            // register with the value in the 
                                            // GPTMTAILR register on the next 
                                            // cycle. If the prescaler is used, 
                                            // update the GPTMTAPS register 
                                            // with the value in the GPTMTAPR 
                                            // register on the next cycle. 1: 
                                            // Update the GPTMTAR register with 
                                            // the value in the GPTMTAILR 
                                            // register on the next cycle. If 
                                            // the prescaler is used, update 
                                            // the GPTMTAPS register with the 
                                            // value in the GPTMTAPR register 
                                            // on the next time-out. 
#define GPTIMER_TAMR_TAILD_M    0x00000100
#define GPTIMER_TAMR_TAILD_S    8
#define GPTIMER_TAMR_TASNAPS    0x00000080  // GPTM Timer A snap-shot mode 0: 
                                            // Snap-shot mode is disabled. 1: 
                                            // If Timer A is configured in 
                                            // periodic mode, the actual 
                                            // free-running value of Timer A is 
                                            // loaded at the time-out event 
                                            // into the GPTM Timer A (GPTMTAR) 
                                            // register. 
#define GPTIMER_TAMR_TASNAPS_M  0x00000080
#define GPTIMER_TAMR_TASNAPS_S  7
#define GPTIMER_TAMR_TAWOT      0x00000040  // GPTM Timer A wait-on-trigger 0: 
                                            // Timer A begins counting as soon 
                                            // as it is enabled. 1: If Timer A 
                                            // is enabled (TAEN is set in the 
                                            // GPTMCTL register), Timer A does 
                                            // not begin counting until it 
                                            // receives a trigger from the 
                                            // Timer in the previous position 
                                            // in the daisy-chain. This bit 
                                            // must be clear for GP Timer 
                                            // module 0, Timer A. 
#define GPTIMER_TAMR_TAWOT_M    0x00000040
#define GPTIMER_TAMR_TAWOT_S    6
#define GPTIMER_TAMR_TAMIE      0x00000020  // GPTM Timer A match interrupt 
                                            // enable 0: The match interrupt is 
                                            // disabled. 1: An interrupt is 
                                            // generated when the match value 
                                            // in the GPTMTAMATCHR register is 
                                            // reached in the one-shot and 
                                            // periodic modes. 
#define GPTIMER_TAMR_TAMIE_M    0x00000020
#define GPTIMER_TAMR_TAMIE_S    5
#define GPTIMER_TAMR_TACDIR     0x00000010  // GPTM Timer A count direction 0: 
                                            // The timer counts down. 1: The 
                                            // timer counts up. When counting 
                                            // up, the timer starts from a 
                                            // value of 0x0. 
#define GPTIMER_TAMR_TACDIR_M   0x00000010
#define GPTIMER_TAMR_TACDIR_S   4
#define GPTIMER_TAMR_TAAMS      0x00000008  // GPTM Timer A alternate mode 0: 
                                            // Capture mode is enabled. 1: PWM 
                                            // mode is enabled. Note: To enable 
                                            // PWM mode, the TACM bit must be 
                                            // cleared and the TAMR field must 
                                            // be configured to 0x2. 
#define GPTIMER_TAMR_TAAMS_M    0x00000008
#define GPTIMER_TAMR_TAAMS_S    3
#define GPTIMER_TAMR_TACMR      0x00000004  // GPTM Timer A capture mode 0: 
                                            // Edge-count mode 1: Edge-time 
                                            // mode 
#define GPTIMER_TAMR_TACMR_M    0x00000004
#define GPTIMER_TAMR_TACMR_S    2
#define GPTIMER_TAMR_TAMR_M     0x00000003  // GPTM Timer A mode 0x0: Reserved 
                                            // 0x1: One-shot mode 0x2: Periodic 
                                            // mode 0x3: Capture mode The timer 
                                            // mode is based on the timer 
                                            // configuration defined by bits 
                                            // [2:0] in the GPTMCFG register. 
#define GPTIMER_TAMR_TAMR_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TBMR register.
//
//*****************************************************************************
#define GPTIMER_TBMR_TBPLO      0x00000800  // Legacy PWM operation 0: Legacy 
                                            // operation 1: CCP is set to 1 on 
                                            // time-out. 
#define GPTIMER_TBMR_TBPLO_M    0x00000800
#define GPTIMER_TBMR_TBPLO_S    11
#define GPTIMER_TBMR_TBMRSU     0x00000400  // Timer B match register update 
                                            // mode 0: Update the GPTMBMATCHR 
                                            // and the GPTMBPR, if used on the 
                                            // next cycle. 1: Update the 
                                            // GPTMBMATCHR and the GPTMBPR, if 
                                            // used on the next time-out. If 
                                            // the timer is disabled (TAEN is 
                                            // clear) when this bit is set, 
                                            // GPTMTBMATCHR and GPTMTBPR are 
                                            // updated when the timer is 
                                            // enabled. If the timer is stalled 
                                            // (TBSTALL is set), GPTMTBMATCHR 
                                            // and GPTMTBPR are updated 
                                            // according to the configuration 
                                            // of this bit. 
#define GPTIMER_TBMR_TBMRSU_M   0x00000400
#define GPTIMER_TBMR_TBMRSU_S   10
#define GPTIMER_TBMR_TBPWMIE    0x00000200  // GPTM Timer B PWM interrupt 
                                            // enable This bit enables 
                                            // interrupts in PWM mode on 
                                            // rising, falling, or both edges 
                                            // of the CCP output. 0: Interrupt 
                                            // is disabled. 1: Interrupt is 
                                            // enabled. This bit is valid only 
                                            // in PWM mode. 
#define GPTIMER_TBMR_TBPWMIE_M  0x00000200
#define GPTIMER_TBMR_TBPWMIE_S  9
#define GPTIMER_TBMR_TBILD      0x00000100  // GPTM Timer B PWM interval load 
                                            // write 0: Update the GPTMTBR 
                                            // register with the value in the 
                                            // GPTMTBILR register on the next 
                                            // cycle. If the prescaler is used, 
                                            // update the GPTMTBPS register 
                                            // with the value in the GPTMTBPR 
                                            // register on the next cycle. 1: 
                                            // Update the GPTMTBR register with 
                                            // the value in the GPTMTBILR 
                                            // register on the next cycle. If 
                                            // the prescaler is used, update 
                                            // the GPTMTBPS register with the 
                                            // value in the GPTMTBPR register 
                                            // on the next time-out. 
#define GPTIMER_TBMR_TBILD_M    0x00000100
#define GPTIMER_TBMR_TBILD_S    8
#define GPTIMER_TBMR_TBSNAPS    0x00000080  // GPTM Timer B snap-shot mode 0: 
                                            // Snap-shot mode is disabled. 1: 
                                            // If Timer B is configured in the 
                                            // periodic mode, the actual 
                                            // free-running value of Timer A is 
                                            // loaded into the GPTM Timer B 
                                            // (GPTMTBR) register at the 
                                            // time-out event. 
#define GPTIMER_TBMR_TBSNAPS_M  0x00000080
#define GPTIMER_TBMR_TBSNAPS_S  7
#define GPTIMER_TBMR_TBWOT      0x00000040  // GPTM Timer B wait-on-trigger 0: 
                                            // Timer B begins counting as soon 
                                            // as it is enabled. 1: If Timer B 
                                            // is enabled (TBEN is set in the 
                                            // GPTMCTL register), Timer B does 
                                            // not begin counting until it 
                                            // receives a trigger from the 
                                            // timer in the previous position 
                                            // in the daisy-chain. 
#define GPTIMER_TBMR_TBWOT_M    0x00000040
#define GPTIMER_TBMR_TBWOT_S    6
#define GPTIMER_TBMR_TBMIE      0x00000020  // GPTM Timer B match interrupt 
                                            // enable 0: The match interrupt is 
                                            // disabled. 1: An interrupt is 
                                            // generated when the match value 
                                            // in the GPTMTBMATCHR register is 
                                            // reached in the one-shot and 
                                            // periodic modes. 
#define GPTIMER_TBMR_TBMIE_M    0x00000020
#define GPTIMER_TBMR_TBMIE_S    5
#define GPTIMER_TBMR_TBCDIR     0x00000010  // GPTM Timer B count direction 0: 
                                            // The timer counts down. 1: The 
                                            // timer counts up. When counting 
                                            // up, the timer starts from a 
                                            // value of 0x0. 
#define GPTIMER_TBMR_TBCDIR_M   0x00000010
#define GPTIMER_TBMR_TBCDIR_S   4
#define GPTIMER_TBMR_TBAMS      0x00000008  // GPTM Timer B alternate mode 0: 
                                            // Capture mode is enabled. 1: PWM 
                                            // mode is enabled. Note: To enable 
                                            // PWM mode, the TBCM bit must be 
                                            // cleared and the TBMR field must 
                                            // be configured to 0x2. 
#define GPTIMER_TBMR_TBAMS_M    0x00000008
#define GPTIMER_TBMR_TBAMS_S    3
#define GPTIMER_TBMR_TBCMR      0x00000004  // GPTM Timer B capture mode 0: 
                                            // Edge-count mode 1: Edge-time 
                                            // mode 
#define GPTIMER_TBMR_TBCMR_M    0x00000004
#define GPTIMER_TBMR_TBCMR_S    2
#define GPTIMER_TBMR_TBMR_M     0x00000003  // GPTM Timer B mode 0x0: Reserved 
                                            // 0x1: One-shot timer mode 0x2: 
                                            // Periodic timer mode 0x3: Capture 
                                            // mode The timer mode is based on 
                                            // the timer configuration defined 
                                            // by bits [2:0] in the GPTMCFG 
                                            // register. 
#define GPTIMER_TBMR_TBMR_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_CTL register.
//
//*****************************************************************************
#define GPTIMER_CTL_TBPWML      0x00004000  // GPTM Timer B PWM output level 
                                            // 0: Output is unaffected. 1: 
                                            // Output is inverted. 
#define GPTIMER_CTL_TBPWML_M    0x00004000
#define GPTIMER_CTL_TBPWML_S    14
#define GPTIMER_CTL_TBOTE       0x00002000  // GPTM Timer B output trigger 
                                            // enable 0: The ADC trigger of 
                                            // output Timer B is disabled. 1: 
                                            // The ADC trigger of output Timer 
                                            // B is enabled. 
#define GPTIMER_CTL_TBOTE_M     0x00002000
#define GPTIMER_CTL_TBOTE_S     13
#define GPTIMER_CTL_TBEVENT_M   0x00000C00  // GPTM Timer B event mode 0x0: 
                                            // Positive edge 0x1: Negative edge 
                                            // 0x2: Reserved 0x3: Both edges 
#define GPTIMER_CTL_TBEVENT_S   10
#define GPTIMER_CTL_TBSTALL     0x00000200  // GPTM Timer B stall enable 0: 
                                            // Timer B continues counting while 
                                            // the processor is halted by the 
                                            // debugger. 1: Timer B freezes 
                                            // counting while the processor is 
                                            // halted by the debugger. 
#define GPTIMER_CTL_TBSTALL_M   0x00000200
#define GPTIMER_CTL_TBSTALL_S   9
#define GPTIMER_CTL_TBEN        0x00000100  // GPTM Timer B enable 0: Timer B 
                                            // is disabled. 1: Timer B is 
                                            // enabled and begins counting or 
                                            // the capture logic is enabled 
                                            // based on the GPTMCFG register. 
#define GPTIMER_CTL_TBEN_M      0x00000100
#define GPTIMER_CTL_TBEN_S      8
#define GPTIMER_CTL_TAPWML      0x00000040  // GPTM Timer A PWM output level 
                                            // 0: Output is unaffected. 1: 
                                            // Output is inverted. 
#define GPTIMER_CTL_TAPWML_M    0x00000040
#define GPTIMER_CTL_TAPWML_S    6
#define GPTIMER_CTL_TAOTE       0x00000020  // GPTM Timer A output trigger 
                                            // enable 0: The ADC trigger of 
                                            // output Timer A is disabled. 1: 
                                            // The ADC trigger of output Timer 
                                            // A is enabled. 
#define GPTIMER_CTL_TAOTE_M     0x00000020
#define GPTIMER_CTL_TAOTE_S     5
#define GPTIMER_CTL_TAEVENT_M   0x0000000C  // GPTM Timer A event mode 0x0: 
                                            // Positive edge 0x1: Negative edge 
                                            // 0x2: Reserved 0x3: Both edges 
#define GPTIMER_CTL_TAEVENT_S   2
#define GPTIMER_CTL_TASTALL     0x00000002  // GPTM Timer A stall enable 0: 
                                            // Timer A continues counting while 
                                            // the processor is halted by the 
                                            // debugger. 1: Timer A freezes 
                                            // counting while the processor is 
                                            // halted by the debugger. 
#define GPTIMER_CTL_TASTALL_M   0x00000002
#define GPTIMER_CTL_TASTALL_S   1
#define GPTIMER_CTL_TAEN        0x00000001  // GPTM Timer A enable 0: Timer A 
                                            // is disabled. 1: Timer A is 
                                            // enabled and begins counting or 
                                            // the capture logic is enabled 
                                            // based on the GPTMCFG register. 
#define GPTIMER_CTL_TAEN_M      0x00000001
#define GPTIMER_CTL_TAEN_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_SYNC register.
//
//*****************************************************************************
