RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_gptimer.h
#define GPTIMER_SYNC_SYNC3_M    0x000000C0  // Synchronize GPTM3 0x0: GPTM3 is 
                                            // not affected. 0x1: A time-out 
                                            // event for Timer A of GPTM3 is 
                                            // triggered. 0x2: A time-out event 
                                            // for Timer B of GPTM3 is 
                                            // triggered. 0x3: A time-out event 
                                            // for Timer A and Timer B of GPTM3 
                                            // is triggered. 
#define GPTIMER_SYNC_SYNC3_S    6
#define GPTIMER_SYNC_SYNC2_M    0x00000030  // Synchronize GPTM2 0x0: GPTM2 is 
                                            // not affected. 0x1: A time-out 
                                            // event for Timer A of GPTM2 is 
                                            // triggered. 0x2: A time-out event 
                                            // for Timer B of GPTM2 is 
                                            // triggered. 0x3: A time-out event 
                                            // for Timer A and Timer B of GPTM2 
                                            // is triggered. 
#define GPTIMER_SYNC_SYNC2_S    4
#define GPTIMER_SYNC_SYNC1_M    0x0000000C  // Synchronize GPTM1 0x0: GPTM1 is 
                                            // not affected. 0x1: A time-out 
                                            // event for Timer A of GPTM1 is 
                                            // triggered. 0x2: A time-out event 
                                            // for Timer B of GPTM1 is 
                                            // triggered. 0x3: A time-out event 
                                            // for Timer A and Timer B of GPTM1 
                                            // is triggered. 
#define GPTIMER_SYNC_SYNC1_S    2
#define GPTIMER_SYNC_SYNC0_M    0x00000003  // Synchronize GPTM0 0x0: GPTM0 is 
                                            // not affected. 0x1: A time-out 
                                            // event for Timer A of GPTM0 is 
                                            // triggered. 0x2: A time-out event 
                                            // for Timer B of GPTM0 is 
                                            // triggered. 0x3: A time-out event 
                                            // for Timer A and Timer B of GPTM0 
                                            // is triggered. 
#define GPTIMER_SYNC_SYNC0_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_IMR register.
//
//*****************************************************************************
#define GPTIMER_IMR_TBMIM       0x00000800  // GPTM Timer B match interrupt 
                                            // mask 0: Interrupt is disabled. 
                                            // 1: Interrupt is enabled. 
#define GPTIMER_IMR_TBMIM_M     0x00000800
#define GPTIMER_IMR_TBMIM_S     11
#define GPTIMER_IMR_CBEIM       0x00000400  // GPTM Timer B capture event 
                                            // interrupt mask 0: Interrupt is 
                                            // disabled. 1: Interrupt is 
                                            // enabled. 
#define GPTIMER_IMR_CBEIM_M     0x00000400
#define GPTIMER_IMR_CBEIM_S     10
#define GPTIMER_IMR_CBMIM       0x00000200  // GPTM Timer B capture match 
                                            // interrupt mask 0: Interrupt is 
                                            // disabled. 1: Interrupt is 
                                            // enabled. 
#define GPTIMER_IMR_CBMIM_M     0x00000200
#define GPTIMER_IMR_CBMIM_S     9
#define GPTIMER_IMR_TBTOIM      0x00000100  // GPTM Timer B time-out interrupt 
                                            // mask 0: Interrupt is disabled. 
                                            // 1: Interrupt is enabled. 
#define GPTIMER_IMR_TBTOIM_M    0x00000100
#define GPTIMER_IMR_TBTOIM_S    8
#define GPTIMER_IMR_TAMIM       0x00000010  // GPTM Timer A match interrupt 
                                            // mask 0: Interrupt is disabled. 
                                            // 1: Interrupt is enabled. 
#define GPTIMER_IMR_TAMIM_M     0x00000010
#define GPTIMER_IMR_TAMIM_S     4
#define GPTIMER_IMR_CAEIM       0x00000004  // GPTM Timer A capture event 
                                            // interrupt mask 0: Interrupt is 
                                            // disabled. 1: Interrupt is 
                                            // enabled. 
#define GPTIMER_IMR_CAEIM_M     0x00000004
#define GPTIMER_IMR_CAEIM_S     2
#define GPTIMER_IMR_CAMIM       0x00000002  // GPTM Timer A capture match 
                                            // interrupt mask 0: Interrupt is 
                                            // disabled. 1: Interrupt is 
                                            // enabled. 
#define GPTIMER_IMR_CAMIM_M     0x00000002
#define GPTIMER_IMR_CAMIM_S     1
#define GPTIMER_IMR_TATOIM      0x00000001  // GPTM Timer A time-out interrupt 
                                            // mask 0: Interrupt is disabled. 
                                            // 1: Interrupt is enabled. 
#define GPTIMER_IMR_TATOIM_M    0x00000001
#define GPTIMER_IMR_TATOIM_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_RIS register.
//
//*****************************************************************************
#define GPTIMER_RIS_TBMRIS      0x00000800  // GPTM Timer B match raw 
                                            // interrupt 
#define GPTIMER_RIS_TBMRIS_M    0x00000800
#define GPTIMER_RIS_TBMRIS_S    11
#define GPTIMER_RIS_CBERIS      0x00000400  // GPTM Timer B capture event raw 
                                            // interrupt 
#define GPTIMER_RIS_CBERIS_M    0x00000400
#define GPTIMER_RIS_CBERIS_S    10
#define GPTIMER_RIS_CBMRIS      0x00000200  // GPTM Timer B capture match raw 
                                            // interrupt 
#define GPTIMER_RIS_CBMRIS_M    0x00000200
#define GPTIMER_RIS_CBMRIS_S    9
#define GPTIMER_RIS_TBTORIS     0x00000100  // GPTM Timer B time-out raw 
                                            // interrupt 
#define GPTIMER_RIS_TBTORIS_M   0x00000100
#define GPTIMER_RIS_TBTORIS_S   8
#define GPTIMER_RIS_TAMRIS      0x00000010  // GPTM Timer A match raw 
                                            // interrupt 
#define GPTIMER_RIS_TAMRIS_M    0x00000010
#define GPTIMER_RIS_TAMRIS_S    4
#define GPTIMER_RIS_CAERIS      0x00000004  // GPTM Timer A capture event raw 
                                            // interrupt 
#define GPTIMER_RIS_CAERIS_M    0x00000004
#define GPTIMER_RIS_CAERIS_S    2
#define GPTIMER_RIS_CAMRIS      0x00000002  // GPTM Timer A capture match raw 
                                            // interrupt 
#define GPTIMER_RIS_CAMRIS_M    0x00000002
#define GPTIMER_RIS_CAMRIS_S    1
#define GPTIMER_RIS_TATORIS     0x00000001  // GPTM Timer A time-out raw 
                                            // interrupt 
#define GPTIMER_RIS_TATORIS_M   0x00000001
#define GPTIMER_RIS_TATORIS_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_MIS register.
//
//*****************************************************************************
#define GPTIMER_MIS_TBMMIS      0x00000800  // GPTM Timer B match masked 
                                            // interrupt 
#define GPTIMER_MIS_TBMMIS_M    0x00000800
#define GPTIMER_MIS_TBMMIS_S    11
#define GPTIMER_MIS_CBEMIS      0x00000400  // GPTM Timer B capture event 
                                            // masked interrupt 
#define GPTIMER_MIS_CBEMIS_M    0x00000400
#define GPTIMER_MIS_CBEMIS_S    10
#define GPTIMER_MIS_CBMMIS      0x00000200  // GPTM Timer B capture match 
                                            // masked interrupt 
#define GPTIMER_MIS_CBMMIS_M    0x00000200
#define GPTIMER_MIS_CBMMIS_S    9
#define GPTIMER_MIS_TBTOMIS     0x00000100  // GPTM Timer B time-out masked 
                                            // interrupt 
#define GPTIMER_MIS_TBTOMIS_M   0x00000100
#define GPTIMER_MIS_TBTOMIS_S   8
#define GPTIMER_MIS_TAMRIS      0x00000010  // GPTM Timer A match raw 
                                            // interrupt 
#define GPTIMER_MIS_TAMRIS_M    0x00000010
#define GPTIMER_MIS_TAMRIS_S    4
#define GPTIMER_MIS_CAEMIS      0x00000004  // GPTM Timer A capture event raw 
                                            // interrupt 
#define GPTIMER_MIS_CAEMIS_M    0x00000004
#define GPTIMER_MIS_CAEMIS_S    2
#define GPTIMER_MIS_CAMMIS      0x00000002  // GPTM Timer A capture match raw 
                                            // interrupt 
#define GPTIMER_MIS_CAMMIS_M    0x00000002
#define GPTIMER_MIS_CAMMIS_S    1
#define GPTIMER_MIS_TATOMIS     0x00000001  // GPTM Timer A time-out raw 
                                            // interrupt 
#define GPTIMER_MIS_TATOMIS_M   0x00000001
#define GPTIMER_MIS_TATOMIS_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_ICR register.
//
//*****************************************************************************
#define GPTIMER_ICR_WUECINT     0x00010000  // GPTM write update error 
                                            // interrupt clear 
#define GPTIMER_ICR_WUECINT_M   0x00010000
#define GPTIMER_ICR_WUECINT_S   16
#define GPTIMER_ICR_TBMCINT     0x00000800  // GPTM Timer B match interrupt 
                                            // clear 
#define GPTIMER_ICR_TBMCINT_M   0x00000800
#define GPTIMER_ICR_TBMCINT_S   11
#define GPTIMER_ICR_CBECINT     0x00000400  // GPTM Timer B capture event 
                                            // Interrupt clear 
#define GPTIMER_ICR_CBECINT_M   0x00000400
#define GPTIMER_ICR_CBECINT_S   10
#define GPTIMER_ICR_CBMCINT     0x00000200  // GPTM Timer B capture match 
                                            // interrupt clear 
#define GPTIMER_ICR_CBMCINT_M   0x00000200
#define GPTIMER_ICR_CBMCINT_S   9
#define GPTIMER_ICR_TBTOCINT    0x00000100  // GPTM Timer B time-out interrupt 
                                            // clear 
#define GPTIMER_ICR_TBTOCINT_M  0x00000100
#define GPTIMER_ICR_TBTOCINT_S  8
#define GPTIMER_ICR_TAMCINT     0x00000010  // GPTM Timer A match interrupt 
                                            // clear 
#define GPTIMER_ICR_TAMCINT_M   0x00000010
#define GPTIMER_ICR_TAMCINT_S   4
#define GPTIMER_ICR_CAECINT     0x00000004  // GPTM Timer A capture event 
                                            // Interrupt clear 
#define GPTIMER_ICR_CAECINT_M   0x00000004
#define GPTIMER_ICR_CAECINT_S   2
#define GPTIMER_ICR_CAMCINT     0x00000002  // GPTM Timer A capture match 
                                            // interrupt clear 
#define GPTIMER_ICR_CAMCINT_M   0x00000002
#define GPTIMER_ICR_CAMCINT_S   1
#define GPTIMER_ICR_TATOCINT    0x00000001  // GPTM Timer A time-out interrupt 
                                            // clear 
#define GPTIMER_ICR_TATOCINT_M  0x00000001
#define GPTIMER_ICR_TATOCINT_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPTIMER_O_TAILR register.
//
//*****************************************************************************
#define GPTIMER_TAILR_TAILR_M   0xFFFFFFFF  // GPTM A interval load register 
#define GPTIMER_TAILR_TAILR_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPTIMER_O_TBILR register.
//
//*****************************************************************************
#define GPTIMER_TBILR_TBILR_M   0x0000FFFF  // GPTM B interval load register 
#define GPTIMER_TBILR_TBILR_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPTIMER_O_TAMATCHR register.
//
//*****************************************************************************
#define GPTIMER_TAMATCHR_TAMR_M 0xFFFFFFFF  // GPTM Timer A match register 
#define GPTIMER_TAMATCHR_TAMR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPTIMER_O_TBMATCHR register.
//
//*****************************************************************************
#define GPTIMER_TBMATCHR_TBMR_M 0x0000FFFF  // GPTM Timer B match register 
#define GPTIMER_TBMATCHR_TBMR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TAPR register.
//
//*****************************************************************************
#define GPTIMER_TAPR_TAPSR_M    0x000000FF  // GPTM Timer A prescale 
#define GPTIMER_TAPR_TAPSR_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TBPR register.
//
//*****************************************************************************
#define GPTIMER_TBPR_TBPSR_M    0x000000FF  // GPTM Timer B prescale 
#define GPTIMER_TBPR_TBPSR_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPTIMER_O_TAPMR register.
//
//*****************************************************************************
#define GPTIMER_TAPMR_TAPSR_M   0x000000FF  // GPTM Timer A prescale match 
#define GPTIMER_TAPMR_TAPSR_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// GPTIMER_O_TBPMR register.
//
//*****************************************************************************
#define GPTIMER_TBPMR_TBPSR_M   0x000000FF  // GPTM Timer B prescale match 
#define GPTIMER_TBPMR_TBPSR_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TAR register.
//
//*****************************************************************************
#define GPTIMER_TAR_TAR_M       0xFFFFFFFF  // GPTM Timer A register 
#define GPTIMER_TAR_TAR_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TBR register.
//
//*****************************************************************************
#define GPTIMER_TBR_TBR_M       0x0000FFFF  // GPTM Timer B register 
#define GPTIMER_TBR_TBR_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TAV register.
//
//*****************************************************************************
#define GPTIMER_TAV_TAV_M       0xFFFFFFFF  // GPTM Timer A register 
#define GPTIMER_TAV_TAV_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TBV register.
//
//*****************************************************************************
#define GPTIMER_TBV_PRE_M       0x00FF0000  // GPTM Timer B prescale register 
                                            // (16-bit mode) 
#define GPTIMER_TBV_PRE_S       16
#define GPTIMER_TBV_TBV_M       0x0000FFFF  // GPTM Timer B register 
#define GPTIMER_TBV_TBV_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TAPS register.
//
//*****************************************************************************
#define GPTIMER_TAPS_PSS_M      0x0000FFFF  // GPTM Timer A prescaler 
#define GPTIMER_TAPS_PSS_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TBPS register.
//
//*****************************************************************************
#define GPTIMER_TBPS_PSS_M      0x0000FFFF  // GPTM Timer B prescaler 
#define GPTIMER_TBPS_PSS_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TAPV register.
//
//*****************************************************************************
#define GPTIMER_TAPV_PSV_M      0x0000FFFF  // GPTM Timer A prescaler value 
#define GPTIMER_TAPV_PSV_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_TBPV register.
//
//*****************************************************************************
#define GPTIMER_TBPV_PSV_M      0x0000FFFF  // GPTM Timer B prescaler value 
#define GPTIMER_TBPV_PSV_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the GPTIMER_O_PP register.
//
//*****************************************************************************
#define GPTIMER_PP_ALTCLK       0x00000040  // Alternate clock source 0: Timer 
                                            // is not capable of using an 
                                            // alternate clock. 1: Timer is 
                                            // capable of using an alternate 
                                            // clock. 
#define GPTIMER_PP_ALTCLK_M     0x00000040
#define GPTIMER_PP_ALTCLK_S     6
#define GPTIMER_PP_SYNCNT       0x00000020  // Synchronized start 0: Timer is 
                                            // not capable of synchronizing the 
                                            // count value with other timers. 
                                            // 1: Timer is capable of 
                                            // synchronizing the count value 
                                            // with other timers. 
#define GPTIMER_PP_SYNCNT_M     0x00000020
#define GPTIMER_PP_SYNCNT_S     5
#define GPTIMER_PP_CHAIN        0x00000010  // Chain with other timers 0: 
                                            // Timer is not capable of chaining 
                                            // with previously numbered Timers. 
                                            // 1: Timer is capable of chaining 
                                            // with previously numbered timers. 
#define GPTIMER_PP_CHAIN_M      0x00000010
#define GPTIMER_PP_CHAIN_S      4
#define GPTIMER_PP_SIZE_M       0x0000000F  // Timer size 0: Timer A and Timer 
                                            // B are 16 bits wide with 8-bit 
                                            // prescale. 1: Timer A and Timer B 
                                            // are 32 bits wide with 16-bit 
                                            // prescale. 
#define GPTIMER_PP_SIZE_S       0


#endif // __HW_GPTIMER_H__

